index.org
#+title: Studying for CSI3105

Note, I recommend cloning [[https://github.com/mahirvaluj/csi3105-studying][the repo]] for this and opening the org file
in emacs, because then the links can be opened inside emacs, it's more
clean. 

* [[./Introduction---Part-1.pdf]]
  - What does "design & analsis of algos" mean?
    - Correctness
    - Does it terminate?
    - Efficiency
    - Limits thereof
    - Pseudocode, no programming
  - Insertion sort
    - This is the one where we start at a position and then swap
      backwards until it fits into place
    - ~~O(n^2)~~ in the worst case
  - Big O notation
    - Big Omega (which is the less than one)
    - Big Theta (Which is the greater than one)
    - What it means to be each one
  - Barometer instruction
    - One which is executed at least as often as any other one
  - Limit Criterion
    - lim(f(n)/g(n))
      - Goes to 0 if f = ~O(g)~
      - Goes to infty if f = Omega(g)
      - Goes to a real if f = Theta(g)
      - If not exist, dunno
       
* [[./Introduction---Part-2.pdf]]
  - The fibonacci numbers
    - Calculating the running time of fib(n)
    - fib(n) is exponential, but fib2(n) is not, because two n-bit
      numbers can be added together in a linear number of bit operations

* [[./Chapter-2---Part-1---MergeSort.pdf]]
  - Divide and conquer algorithms
    - Divide the problem
    - Conquer each subproblem recursively
    - Combine
  - Merge sort
    - If size = 1: do nothing
    - if size >= 2: divide n numbers into two sequences, run merge
      sort twice, and merge it back into a sorted sequence
  - Computing runtime of merge sort
    - T(n) = c if n=1, or 2T(n/2) + cn if n >= 2
    - Solving by unfolding
      - All steps are outlined in document
    - We find T(n) <= 2cnlog_2(n)
    - Therefore merge sort is Theta(n log_2(n)) if n is a power of 2

* [[./Chapter-2---Part-2---StrassenAlgorithm.pdf]]
  - What is matrix multiplication?
  - Trivial algorithm: triple for loop
  - Strassen algorithm
  - How can we divide and conquer?
    - Split A, B (inputs) into four separate matrices
    - Then compute the quadrants of C as products of these
      - We find no improvement.
    - However the strassen algorithm derives various intermediate matrices
      and then finds C as a prodcut of these matrices
      - (P_1 through P_7). Their calculations are in the notes.
      - It then derives the quadrants of C to be products of P1 through P7
    - After computing this through unfolding we then calculate that we
      have ~O(nlog_2(7) where log2(7)~ is approx 2.81
  - There is also another algorithm by coppersmith and winograd, but
    that wasn't covered, it's very group theory heavy.

* [[./Chapter-2---Part-3---MasterTheorem.pdf]]
  - Master theorem
    - Let T be a function defined by parts. If
      - T(1) = 1
      - T(n) = a . T(n / b) + n^d where A >= 1, b > 1, d >= 0
        - If d > logb(a) then T(n) = ~O(n^d)~
        - If d = logb(a) then T(n) = ~O(n^d log(n))~
        - if d < logb(a) then T(n) = ~O(n^{logb(a)})~
  - They then use the master theorem on merge sort and strassen and
    binary search to find results.

* [[./Chapter-2---Part-4---SelectionAlgorithm.pdf]]
  - Selection algo 
    - Find kth smallest number in array of n numbers
  - Naive algo:
    - Sort S
    - return the element at position k
    - Runs in ~O(n log n)~
    - Without sorting:
      - find pivot, go through array like quicksort, but instead of
        then sorting each sub-array, simply use the fact that it's
        less than k to continually go inwards.
      - Quickselect
        - Worst case: ~O(n^2)~ if you pick bad pivots every time
        - Average case: ~O(n)~ because on average a random pivot will be
          close to median
        - Has a thing where they find a pivot

