index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-18 Wed 15:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Studying for CSI3105</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Studying for CSI3105</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8503b24">1. ./Introduction&#x2014;Part-1.pdf</a></li>
<li><a href="#orgdeb36f1">2. ./Introduction&#x2014;Part-2.pdf</a></li>
<li><a href="#org2a9a678">3. ./Chapter-2&#x2014;Part-1&#x2014;MergeSort.pdf</a></li>
<li><a href="#orgf25e9d4">4. ./Chapter-2&#x2014;Part-2&#x2014;StrassenAlgorithm.pdf</a></li>
<li><a href="#orgac88890">5. ./Chapter-2&#x2014;Part-3&#x2014;MasterTheorem.pdf</a></li>
<li><a href="#org7a5b8c1">6. ./Chapter-2&#x2014;Part-4&#x2014;SelectionAlgorithm.pdf</a></li>
<li><a href="#orgc41375c">7. ./Chapter-3&#x2014;GraphsAlgorithms&#x2014;Part-1&#x2014;Intro.pdf</a></li>
<li><a href="#org0a78d23">8. ./Chapter-3&#x2014;GraphsAlgorithms&#x2014;Part-2&#x2014;ExploringUndirectedGraphs.pdf</a></li>
<li><a href="#org16e509f">9. ./Chapter-3&#x2014;GraphsAlgorithms&#x2014;Part-3&#x2014;ExploringDirectedGraphs.pdf</a></li>
<li><a href="#org064f104">10. ./Chapter-3&#x2014;GraphsAlgorithms&#x2014;Part-4&#x2014;Dijkstra.pdf</a></li>
<li><a href="#orge78cad7">11. ./Chapter-3&#x2014;GraphsAlgorithms&#x2014;Part-5&#x2014;DijkstraCorrectness.pdf</a></li>
<li><a href="#org9fd8eeb">12. ./Chapter-4&#x2014;GreedyAlgorithms&#x2014;Part-3.1&#x2014;MST.pdf</a></li>
<li><a href="#orgb5172f6">13. ./Chapter-4&#x2014;GreedyAlgorithms&#x2014;Part-3.2&#x2014;Kruskal.pdf</a></li>
<li><a href="#orga144639">14. ./Chapter-4&#x2014;GreedyAlgorithms&#x2014;Part-3.3&#x2014;Prim.pdf</a></li>
<li><a href="#orga843b6e">15. ./Chapter-5&#x2014;Part-1&#x2014;ShortestPathsAcyclic.pdf</a></li>
<li><a href="#orgdaad7ab">16. ./Chapter-5&#x2014;Part-2&#x2014;MatrixChainMultiplication.pdf</a></li>
<li><a href="#org1b401e5">17. ./Chapter-5&#x2014;Part-3&#x2014;LCS.pdf</a></li>
<li><a href="#org3f6ba47">18. ./Chapter-5&#x2014;Part-4&#x2014;GeneralStructure.pdf</a></li>
<li><a href="#org9705dda">19. ./Chapter-5&#x2014;Part-5&#x2014;AllPairsShortestPath.pdf</a></li>
<li><a href="#orgc31e424">20. ./Chapter-5&#x2014;Part-6&#x2014;FinalRemark.pdf</a></li>
</ul>
</div>
</div>
<p>
Note, I recommend cloning <a href="https://github.com/mahirvaluj/csi3105-studying">the repo</a> for this and opening the org file
in emacs, because then the links can be opened inside emacs, it's more
clean. 
</p>

<div id="outline-container-org8503b24" class="outline-2">
<h2 id="org8503b24"><span class="section-number-2">1</span> <a href="./Introduction---Part-1.pdf">./Introduction---Part-1.pdf</a></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>What does "design &amp; analsis of algos" mean?
<ul class="org-ul">
<li>Correctness</li>
<li>Does it terminate?</li>
<li>Efficiency</li>
<li>Limits thereof</li>
<li>Pseudocode, no programming</li>
</ul></li>
<li>Insertion sort
<ul class="org-ul">
<li>This is the one where we start at a position and then swap
backwards until it fits into place</li>
<li><code>~O(n^2)~</code> in the worst case</li>
</ul></li>
<li>Big O notation
<ul class="org-ul">
<li>Big Omega (which is the less than one)</li>
<li>Big Theta (Which is the greater than one)</li>
<li>What it means to be each one</li>
</ul></li>
<li>Barometer instruction
<ul class="org-ul">
<li>One which is executed at least as often as any other one</li>
</ul></li>
<li>Limit Criterion
<ul class="org-ul">
<li>lim(f(n)/g(n))
<ul class="org-ul">
<li>Goes to 0 if f = <code>O(g)</code></li>
<li>Goes to infty if f = Omega(g)</li>
<li>Goes to a real if f = Theta(g)</li>
<li>If not exist, dunno</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgdeb36f1" class="outline-2">
<h2 id="orgdeb36f1"><span class="section-number-2">2</span> <a href="./Introduction---Part-2.pdf">./Introduction---Part-2.pdf</a></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>The fibonacci numbers
<ul class="org-ul">
<li>Calculating the running time of fib(n)</li>
<li>fib(n) is exponential, but fib2(n) is not, because two n-bit
numbers can be added together in a linear number of bit operations</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2a9a678" class="outline-2">
<h2 id="org2a9a678"><span class="section-number-2">3</span> <a href="./Chapter-2---Part-1---MergeSort.pdf">./Chapter-2---Part-1---MergeSort.pdf</a></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Divide and conquer algorithms
<ul class="org-ul">
<li>Divide the problem</li>
<li>Conquer each subproblem recursively</li>
<li>Combine</li>
</ul></li>
<li>Merge sort
<ul class="org-ul">
<li>If size = 1: do nothing</li>
<li>if size &gt;= 2: divide n numbers into two sequences, run merge
sort twice, and merge it back into a sorted sequence</li>
</ul></li>
<li>Computing runtime of merge sort
<ul class="org-ul">
<li>T(n) = c if n=1, or 2T(n/2) + cn if n &gt;= 2</li>
<li>Solving by unfolding
<ul class="org-ul">
<li>All steps are outlined in document</li>
</ul></li>
<li>We find T(n) &lt;= 2cnlog<sub>2</sub>(n)</li>
<li>Therefore merge sort is Theta(n log<sub>2</sub>(n)) if n is a power of 2</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf25e9d4" class="outline-2">
<h2 id="orgf25e9d4"><span class="section-number-2">4</span> <a href="./Chapter-2---Part-2---StrassenAlgorithm.pdf">./Chapter-2---Part-2---StrassenAlgorithm.pdf</a></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>What is matrix multiplication?</li>
<li>Trivial algorithm: triple for loop</li>
<li>Strassen algorithm</li>
<li>How can we divide and conquer?
<ul class="org-ul">
<li>Split A, B (inputs) into four separate matrices</li>
<li>Then compute the quadrants of C as products of these
<ul class="org-ul">
<li>We find no improvement.</li>
</ul></li>
<li>However the strassen algorithm derives various intermediate matrices
and then finds C as a prodcut of these matrices
<ul class="org-ul">
<li>(P<sub>1</sub> through P<sub>7</sub>). Their calculations are in the notes.</li>
<li>It then derives the quadrants of C to be products of P1 through P7</li>
</ul></li>
<li>After computing this through unfolding we then calculate that we
have <code>O(nlog_2(7) where log2(7)</code> is approx 2.81</li>
</ul></li>
<li>There is also another algorithm by coppersmith and winograd, but
that wasn't covered, it's very group theory heavy.</li>
</ul>
</div>
</div>

<div id="outline-container-orgac88890" class="outline-2">
<h2 id="orgac88890"><span class="section-number-2">5</span> <a href="./Chapter-2---Part-3---MasterTheorem.pdf">./Chapter-2---Part-3---MasterTheorem.pdf</a></h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Master theorem
<ul class="org-ul">
<li>Let T be a function defined by parts. If
<ul class="org-ul">
<li>T(1) = 1</li>
<li>T(n) = a . T(n / b) + n<sup>d</sup> where A &gt;= 1, b &gt; 1, d &gt;= 0
<ul class="org-ul">
<li>If d &gt; logb(a) then T(n) = <code>O(n^d)</code></li>
<li>If d = logb(a) then T(n) = <code>O(n^d log(n))</code></li>
<li>if d &lt; logb(a) then T(n) = <code>O(n^{logb(a)})</code></li>
</ul></li>
</ul></li>
</ul></li>
<li>They then use the master theorem on merge sort and strassen and
binary search to find results.</li>
</ul>
</div>
</div>

<div id="outline-container-org7a5b8c1" class="outline-2">
<h2 id="org7a5b8c1"><span class="section-number-2">6</span> <a href="./Chapter-2---Part-4---SelectionAlgorithm.pdf">./Chapter-2---Part-4---SelectionAlgorithm.pdf</a></h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Selection algo 
<ul class="org-ul">
<li>Find kth smallest number in array of n numbers</li>
</ul></li>
<li>Naive algo:
<ul class="org-ul">
<li>Sort S</li>
<li>return the element at position k</li>
<li>Runs in <code>O(n log n)</code></li>
<li>Without sorting:
<ul class="org-ul">
<li>find pivot, go through array like quicksort, but instead of
then sorting each sub-array, simply use the fact that it's
less than k to continually go inwards.</li>
<li>Quickselect
<ul class="org-ul">
<li>Worst case: <code>O(n^2)</code> if you pick bad pivots every time</li>
<li>Average case: <code>O(n)</code> because on average a random pivot will be
close to median</li>
<li>Has a thing where they find a pivot</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
