index.html

<div id="outline-container-orgc41375c" class="outline-2">
<h2 id="orgc41375c"><span class="section-number-2">7</span> <a href="./Chapter-3---GraphsAlgorithms---Part-1---Intro.pdf">./Chapter-3---GraphsAlgorithms---Part-1---Intro.pdf</a></h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Graphs!
<ul class="org-ul">
<li>Set of vertices and set of edges <code>(V, E)</code></li>
<li>Graph is <b>Undirected</b> if each edge is a 2-set</li>
<li>Graph is <b>Directed</b> if each edge is an ordered 2-tuple
<ul class="org-ul">
<li>Facebook friends are undirected</li>
<li>Web page links are directed</li>
</ul></li>
</ul></li>
<li><b>Adjacent</b> edges <code>(u, v)</code>
<ul class="org-ul">
<li>if there is an edge between <code>u</code> and <code>v</code>.</li>
</ul></li>
<li><b>Incident</b> vertex v to an edge
<ul class="org-ul">
<li>If one of the vertexes of the edge is v</li>
</ul></li>
<li><b>degree</b> of <code>u \in V</code>
<ul class="org-ul">
<li>Equal to the num edges incident to u</li>
</ul></li>
<li><b>Outdegree</b> of <code>u \in V</code>
<ul class="org-ul">
<li>Equal to num of edges <code>e</code> such that <code>u</code> is the starting point of
<code>e</code>.</li>
</ul></li>
<li><b>Indegree</b> of <code>u \in V</code>
<ul class="org-ul">
<li>Num of edges such that <code>u</code> is endpoint of edge</li>
</ul></li>
<li>Handshaking Lemma
<ul class="org-ul">
<li>Let <code>G = (V, E)</code>. Then
<ul class="org-ul">
<li>Sum(deg(u)) forall u = 2|E|
<ul class="org-ul">
<li>proof: each edge counted twice lel</li>
</ul></li>
</ul></li>
</ul></li>
<li>How to store a graph
<ul class="org-ul">
<li>Adjacency matrix
<ul class="org-ul">
<li>In <code>O(1)</code> time we get whether two vertices are adjacent</li>
<li>Uses n<sup>2</sup> space</li>
<li>Finding all neighbours takes <code>O(n)</code> time</li>
</ul></li>
<li>Adjacency list
<ul class="org-ul">
<li>Uses |V| + |E| space</li>
<li>Finding all neighbours of a vertex takes <code>O(1 + deg(u))</code> time
(depeneding on implementation of list)</li>
<li>Testing if (u, v) is an edge takes the same amount of time as
finding all neighbours</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0a78d23" class="outline-2">
<h2 id="org0a78d23"><span class="section-number-2">8</span> <a href="./Chapter-3---GraphsAlgorithms---Part-2---ExploringUndirectedGraphs.pdf">./Chapter-3---GraphsAlgorithms---Part-2---ExploringUndirectedGraphs.pdf</a></h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Depth first search
<ul class="org-ul">
<li>Find all vertices that can be reached from <code>v \in V</code></li>
<li>Tracing of function via lines on graph?</li>
<li>It'll generate a trees, and all the other edges are back cycles and stuff</li>
<li>Proves that DFS terminates</li>
<li>Proves that it visits all vertices that are reachable from <code>v</code>
<ul class="org-ul">
<li>This proof is worth reading</li>
</ul></li>
</ul></li>
<li>Finding connected components of G = (V, E)
<ul class="org-ul">
<li>We have some algo DFS</li>
<li>Finding connected components is done by doing DFS on all
unvisited nodes (which get filled out as one DFS call is done)</li>
<li>And then a number gets incremented</li>
</ul></li>
<li>Runtime: 
<ul class="org-ul">
<li>First loop: <code>O(|V|)</code> time</li>
<li>Second loop: 
<ul class="org-ul">
<li>explore(u) is called for each vertex u</li>
<li>Time spent in exlore(u) is <code>O(1 + deg(u))</code></li>
</ul></li>
<li><code>O(|V| + sum(1 + deg(u)) forall u) = O(|V| + |V| + 2|E|)</code> =
<code>O(|V| + |E|)</code></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org16e509f" class="outline-2">
<h2 id="org16e509f"><span class="section-number-2">9</span> <a href="./Chapter-3---GraphsAlgorithms---Part-3---ExploringDirectedGraphs.pdf">./Chapter-3---GraphsAlgorithms---Part-3---ExploringDirectedGraphs.pdf</a></h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Topological ordering
<ul class="org-ul">
<li>Exists on a graph that is <b>directed</b> and <b>acyclic</b></li>
<li>such that for edge (u, v) #(u) &lt; #(v)</li>
<li>Algo is:
<ul class="org-ul">
<li>find vertex with indegree 0</li>
<li>give u the num k</li>
<li>remove u from G</li>
<li>and so on and so forth</li>
<li>there is an example in the notes</li>
</ul></li>
</ul></li>
<li><b>Prenumbers</b> and <b>Postnumbers</b>
<ul class="org-ul">
<li><code>G = (V, E)</code> is directed.</li>
<li><code>forall v \in V</code>, the following two numbers with respect to DFS:</li>
<li><code>pre(v)</code> is the first time we visit <code>v</code></li>
<li><code>post(v)</code> is the time when <code>explore(v)</code> is done
<ul class="org-ul">
<li>This uses a variable clock. Each time pre or postvisit number
is assigned to a node, it gets incremented for next node</li>
<li>There is an example in the notes</li>
<li>Note: edges found in DFS are <b>Tree edges</b></li>
<li>There is then a concept of <b>forward</b> and <b>back</b> edges
<ul class="org-ul">
<li>Edges going down the DFS tree are forward</li>
<li>Going up -&gt; backwards</li>
<li><b>Cross</b> edges go from one branch of the tree to another
<ul class="org-ul">
<li>Cross edges are neither forwards, backwards, nor tree
edges. They are the remainder.</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
<li>To find the types of an edge:
<ul class="org-ul">
<li><b>Forwards</b>: 
<ul class="org-ul">
<li><code>(v, u)</code> is not a tree edge</li>
<li><code>pre(v) &lt; pre(u) &lt; post(u) &lt; post(v)</code></li>
</ul></li>
<li><b>Back edge</b>:
<ul class="org-ul">
<li><code>(v, u)</code> not tree edge</li>
<li><code>pre(u) &lt; pre(v) &lt; post(v) &lt; post(u)</code></li>
</ul></li>
<li><b>Cross edge</b>:
<ul class="org-ul">
<li><code>(v, u)</code> not tree edge</li>
<li><code>pre(u) &lt; post(u) &lt; pre(v) &lt; post(v)</code></li>
</ul></li>
</ul></li>
<li>To determine whether a directed graph has a directed cycle:
<ul class="org-ul">
<li>Graph has cycle iff DFS-forest has back-edge
<ul class="org-ul">
<li>Proof in notes</li>
</ul></li>
<li>If directed graph is cyclic:
<ol class="org-ol">
<li>run dfs including pre/post nums</li>
<li>for each edge test if edge is back edge (via inequality up top)
2.1 if yes then yes
2.2 if no then no</li>
<li>Runtime: <code>O(|V| + |E|)</code></li>
</ol></li>
<li>How to compute a topolotical ordering?
<ol class="org-ol">
<li>Run dfs</li>
<li>Run bucket sort to sort vertices by postnumber</li>
<li>obtain topological ordering from reverse sorted order of
postnumbers</li>
</ol></li>
<li>Bucket sort takes <code>O(n) time, so runtime = O(|V| + |E|)</code>
<ul class="org-ul">
<li>Proof of correctness in notes</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org064f104" class="outline-2">
<h2 id="org064f104"><span class="section-number-2">10</span> <a href="./Chapter-3---GraphsAlgorithms---Part-4---Dijkstra.pdf">./Chapter-3---GraphsAlgorithms---Part-4---Dijkstra.pdf</a></h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Dijstra's algo
<ul class="org-ul">
<li>input:
<ul class="org-ul">
<li>A directed graph <code>G = (V, E)</code> where each edge has a weight <code>wt(u,
          v) &gt; 0</code></li>
<li>a vertex <code>s</code> which is the source</li>
</ul></li>
<li>Output:
<ul class="org-ul">
<li>For each vertex: <code>\del(s, v) =</code> len of shortest path from s to v</li>
</ul></li>
<li>if all weights equal, this is easy, use BFS.</li>
<li>algo:
<ol class="org-ol">
<li>for each vertex, maintain <code>d(v)</code>, the current shortest known path</li>
<li>start out with <code>d(s)</code> = 0, and <code>d(!s) = \infty</code></li>
<li>Loop:
<ol class="org-ol">
<li>Pick a vertex u for which <code>d(u) = \del(s, u)</code>.</li>
<li>For each edge, <code>(u, v)</code>, <code>d(v) = min{d(v), d(u) + wt(u, v)}</code>
<ul class="org-ul">
<li>But how to find u?
<ul class="org-ul">
<li>Maintain <code>S \subset V</code> such that for all <code>v \in S</code>:</li>
<li><code>d(v) = \del(s, v),</code> (i.e. we know <code>\del(s, v)</code>)</li>
</ul></li>
</ul></li>
</ol></li>
</ol></li>
<li>Algo runthrough done in notes</li>
<li>Store the set of nodes to visit in a min-heap
<ul class="org-ul">
<li>Initialization <code>O(n)</code></li>
<li>One iteration:
<ol class="org-ol">
<li>find <code>u</code> and delete it from <code>Q</code>.
<ul class="org-ul">
<li>O(log(n)) time</li>
</ul></li>
<li>For each edge, update d(v):
<ul class="org-ul">
<li>decrease<sub>key</sub> : O(log(n)) time</li>
</ul></li>
</ol></li>
<li>Time total for iteration
<ul class="org-ul">
<li><code>O(log(n)) + O(outdegree(u) * log(n))</code></li>
</ul></li>
<li>After some calculations, total runtime is <code>O((m + n) log(n))</code>
<ul class="org-ul">
<li>Note using Fibonacci heap to store Q we could do O(n log n + m time)</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge78cad7" class="outline-2">
<h2 id="orge78cad7"><span class="section-number-2">11</span> <a href="./Chapter-3---GraphsAlgorithms---Part-5---DijkstraCorrectness.pdf">./Chapter-3---GraphsAlgorithms---Part-5---DijkstraCorrectness.pdf</a></h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>You know the drill, correctness proof for dijkstra's
<ul class="org-ul">
<li><p>
We say that a vertex <code>v</code> is special if all vertices on that path
are in <code>S</code> (except <code>v</code>).
</p>
<ul class="org-ul">
<li>We prove by induction that if <code>u \in S</code> then <code>d(u)</code> is shortest</li>
</ul>
<p>
path from <code>s</code> to <code>u</code>.
</p>
<ul class="org-ul">
<li>If it is not, then it is the shortest "special path" from <code>s</code>
to <code>u</code></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
