index.html

<div id="outline-container-org9fd8eeb" class="outline-2">
<h2 id="org9fd8eeb"><span class="section-number-2">12</span> <a href="./Chapter-4---GreedyAlgorithms---Part-3.1---MST.pdf">./Chapter-4---GreedyAlgorithms---Part-3.1---MST.pdf</a></h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>Sidetrack into Union-Find data structures, also known as
disjoint-set data structures:</li>
<li>It's just a data strucutre of sets that have two operations:</li>
<li>Stored as a set of linked lists with the head containing the name,
and each element containing a pointer to the head of their list
<ul class="org-ul">
<li><code>find(x)</code> which returns the set in which is contained <code>x</code>
<ul class="org-ul">
<li>takes <code>O(1)</code> time because there is a pointer to the head</li>
</ul></li>
<li><code>union(a, b, c)</code> which takes three sets and modifies <code>c = a \cup
      b, and a = b = nullset</code>
<ul class="org-ul">
<li>a union op takes <code>O(size(b))</code> time, because of setting
pointers to change the head of the list
<ul class="org-ul">
<li>could also take <code>min{map(size, a,b)}</code> time by storing the
size the head of the list</li>
</ul></li>
<li>Time for <code>n - 1</code> union operations is <code>O(n log n)</code>
<ul class="org-ul">
<li>Because doing unions 'doubles (this is purely intuitive, it
doesn't actually double)' the size of a set, you change the
pointer for each element on average log<sub>2</sub>(n) times</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb5172f6" class="outline-2">
<h2 id="orgb5172f6"><span class="section-number-2">13</span> <a href="./Chapter-4---GreedyAlgorithms---Part-3.2---Kruskal.pdf">./Chapter-4---GreedyAlgorithms---Part-3.2---Kruskal.pdf</a></h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>Algorithm to find MST
<ul class="org-ul">
<li>Maintain a forest. In each step, add an edge of minimum weight
that doesn't create a cycle.</li>
<li>One iteration combines two trees using an edge of minimum weight</li>
<li>Store the edges by weight</li>
</ul></li>
<li>input: <code>G = V,E</code>, where <code>V = {x_1, x_2, ...}</code> and <code>m = |E|</code> and <code>n = |V|</code>.</li>
<li>output: A minimum spanning tree of <code>G</code>.</li>
<li>Algorithm:
<ul class="org-ul">
<li>Sort the edges by merge sort</li>
<li><code>for i = 1 to n do</code>
<ul class="org-ul">
<li><code>V_i = {xi}</code> [union-find data structure representation]</li>
</ul></li>
<li><code>T = nullset</code></li>
<li><code>for k = 1 to m do</code>
<ul class="org-ul">
<li><code>(u_k, v_k) = e_k</code></li>
<li><code>u_k \in V_i</code> (here, i and j are speshul)</li>
<li><code>v_k \in V_j</code></li>
<li><code>if i != j</code>
<ul class="org-ul">
<li><code>V_i = V_i \cup V_j</code></li>
<li><code>V_j = nullset</code></li>
<li><code>T = T \cup {{u_k, v_k}}</code></li>
</ul></li>
</ul></li>
<li>Return <code>T</code></li>
<li>runtime:
<ul class="org-ul">
<li>Sorting: <code>O(m log m) = O(m log n)</code></li>
<li>First for: <code>O(n)</code></li>
<li>Second for:
<ul class="org-ul">
<li>T is in linked list, and this takes <code>O(n)</code>.</li>
<li>Storing the sets in the union-find data structure means that
we know the runtime if we do</li>
<li>2m find operations and n - 1 union operations:
<ul class="org-ul">
<li><code>O(n) + O(m + n log n)</code> tim</li>
</ul></li>
</ul></li>
<li>Total is:
<ul class="org-ul">
<li><code>O(m log n) + O(n) + O(m + n log n) = O(m log n)</code></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga144639" class="outline-2">
<h2 id="orga144639"><span class="section-number-2">14</span> <a href="./Chapter-4---GreedyAlgorithms---Part-3.3---Prim.pdf">./Chapter-4---GreedyAlgorithms---Part-3.3---Prim.pdf</a></h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>Prim Algorithm</li>
<li>This one is a lot easier intuitively, because it's more obvious
that it's correct.</li>
<li>Start with a set of edge <code>u \in ~A</code>, and extend <code>A</code> with a minimum
edge from an element of <code>A</code> to <code>G = V \ A</code>, and add the end of
that edge to <code>A</code>.</li>
<li>Repeat until <code>A = G</code></li>
<li>Algorithm:</li>
<li>input: <code>G = (V, E)</code>
<ul class="org-ul">
<li><code>r =</code> some arbitrary vertex</li>
<li><code>A = {r}</code></li>
<li><code>T = {}</code></li>
<li>while <code>A != V</code> do
<ul class="org-ul">
<li>find some edge of minimum weight such that <code>u \in A, v \in V \ A</code></li>
<li>add to <code>A</code>, add to <code>T</code>.</li>
</ul></li>
<li>return <code>T</code></li>
</ul></li>
<li>How do we find the edge? by brute force it is O(|E|). This is
obviously infeasible, as the runtime becomes O(|V|.|E|). However,
we can store this in a better way.</li>
<li>For each vertex in <code>G</code>, maintain <code>minweight</code> and <code>closest</code> 
<ul class="org-ul">
<li><code>minweight:</code> the minimum weight of any edge between that edge and a
vertex of <code>A</code>.</li>
<li><code>closest:</code> vertex <code>x</code> in <code>A</code> for which <code>wt(x, y)</code> = <code>minweight(y)</code></li>
</ul></li>
<li>When we move something into <code>A</code>, then also update the minweights
and closest of its neighbours in <code>Q</code>.</li>
<li>Algorithm (this one is a lot more complicated than before, I'll
write it in if I get a chance later but for now go check the last
page of this chapter):</li>
</ul>
</div>
</div>

<div id="outline-container-orga843b6e" class="outline-2">
<h2 id="orga843b6e"><span class="section-number-2">15</span> <a href="./Chapter-5---Part-1---ShortestPathsAcyclic.pdf">./Chapter-5---Part-1---ShortestPathsAcyclic.pdf</a></h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>Dynamic programming! this is the stuff you know best.</li>
<li>For some <code>G = V, E</code>, directed, acyclic, where each edge has <code>wt(u,
    v) &gt; 0</code></li>
<li>Topolotical sorting:
<ul class="org-ul">
<li>Vertices are numbered such that for each edge <code>(v_i, v_j)</code>, <code>i &lt; j</code>.</li>
</ul></li>
<li>Let <code>s = v_1</code>, <code>t = v_n</code>.</li>
<li>how to compute shortest path from <code>s</code> to <code>t</code>?</li>
<li>Can we do better than dijkstras, using the topological sort? Yes,
because we can compute the problem as we go.</li>
<li>We know that the shortest path from s to t is equal to the minimum
from all the nodes connected to t + the path from the start to any
of these nodes</li>
<li>If we compute the distances <code>d(v_1) to d(v_n)</code> beforehand (where
d(v<sub>x</sub>) is the distance from v<sub>0</sub> to it) [like the start node, s],
then we can solve this in O(|V| + |E|) because you do a linear
search at each node.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdaad7ab" class="outline-2">
<h2 id="orgdaad7ab"><span class="section-number-2">16</span> <a href="./Chapter-5---Part-2---MatrixChainMultiplication.pdf">./Chapter-5---Part-2---MatrixChainMultiplication.pdf</a></h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li>honestly these notes are pretty terse, so just read them if you
have anything on optimal matrix multiplication</li>
</ul>
</div>
</div>

<div id="outline-container-org1b401e5" class="outline-2">
<h2 id="org1b401e5"><span class="section-number-2">17</span> <a href="./Chapter-5---Part-3---LCS.pdf">./Chapter-5---Part-3---LCS.pdf</a></h2>
<div class="outline-text-2" id="text-17">
<ul class="org-ul">
<li>Longest common sequence</li>
<li>Give two sequences, what is the longest common sequence?</li>
<li>create a matrix such that <code>c(i,j)</code> is equal to <code>LCS(x[..i],
    y[..j])</code>, like what you did for that number partitioning problem
in foobar.</li>
</ul>
</div>
</div>

<div id="outline-container-org3f6ba47" class="outline-2">
<h2 id="org3f6ba47"><span class="section-number-2">18</span> <a href="./Chapter-5---Part-4---GeneralStructure.pdf">./Chapter-5---Part-4---GeneralStructure.pdf</a></h2>
<div class="outline-text-2" id="text-18">
<ul class="org-ul">
<li>This one doesn't actually have any info, just that if you want to
solve a problem using dynamic programming, create a recurrence
relation on the problem and then cache your results and solve it
bottom-up</li>
</ul>
</div>
</div>

<div id="outline-container-org9705dda" class="outline-2">
<h2 id="org9705dda"><span class="section-number-2">19</span> <a href="./Chapter-5---Part-5---AllPairsShortestPath.pdf">./Chapter-5---Part-5---AllPairsShortestPath.pdf</a></h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li>All pairs shortest paths</li>
<li>Let <code>G = V, E</code> be a directed graph, where <code>V = [1..n]</code>, and each
edge is greater than 0.</li>
<li>For all i and j, compute the weight of a shortest path in <code>G</code> from
i to j, which I'll call d(i,j) [it's actually &delta;<sub>G</sub>(i,j), but
that's cumbersome]</li>
<li>Consider the shortest path from i to j, if the path has an
interior vertex, it's the path from one node to another, and this
can be framed dynamically</li>
</ul>
</div>
</div>



<div id="outline-container-orgc31e424" class="outline-2">
<h2 id="orgc31e424"><span class="section-number-2">20</span> <a href="./Chapter-5---Part-6---FinalRemark.pdf">./Chapter-5---Part-6---FinalRemark.pdf</a></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-11-18 Wed 15:59</p>
<p class="validation"></p>
</div>
</body>
</html>
